
	
$('document').ready(function() {
	alert("js가져옴");

	var area0 = ["시/도","서울","경기","인천","대전","대구","부산","울산","광주","충남","충북","경남","경북","전남","전북","강원","제주"];

	var area1 = ["전체","강남","선릉","서초","송파","잠실","강동","동작","관악","금천","영등포","구로","양천","강서","마포","공덕","용산","중구","종로","성동","광진","동대문","중랑","성북","강북","노원","도봉","은평","서대문"];

	var area2 = ["전체","파주","고양","일산","김포","부천","시흥","배곧","안산","군포","안양","평촌","과천","광명","의왕","수원","광교","화성","동탄","오산","평택","안성","용인","성남","분당","광주","하남","남양주","의정부","양주","동두천","포천","이천","여주"];

	var area3 = ["전체","부평","간석","구월","남동","연수","송도","서구","청라","계양","동구","중구","미추홀","영종도"];

	var area4 = ["전체","유성","서구","동구","중구","대덕"];

	var area5 = ["전체","달서구","수성","서구","남구","북구","중구","동구","달성"];

	var area6 = ["전체","서면","해운대","부산진","수영","연제","동래","사하","사상","강서","금정","남구","동구","북구","서구","중구","기장"];

	var area7 = ["전체","남구","동구","북구","중구","울주군"];

	var area8 = ["전체","광산구","남구","동구","북구","서구"];

	var area9 = ["전체","천안","아산","세종","당진"];

	var area9 = ["전체","청주","음성","진천","충주","제천"];

	var area10 = ["전체","창원","김해","장유","양산","진주","통영","거제","밀양"];

	var area11 = ["전체","구미","김천","안동","영주","경산","경주","포항"];

	var area12 = ["전체","여수","순천","광양","목포","나주"];

	var area13 = ["전체","전주","익산","군산","김제","정읍"];

	var area14 = ["전체","원주","춘천","강릉","속초","삼천"];

	var area15 = ["전체","제주시","서귀포"];

 

	// 시/도 선택 박스 초기화

	$("select[name^=sido]").each(function() {

		$selsido = $(this);

		$.each(eval(area0), function() {

			$selsido.append("<option value='"+this+"'>"+this+"</option>");

		});

		$selsido.next().append("<option value=''>구/군</option>");

	});



	// 시/도 선택시 구/군 설정

	$("select[name^=sido]").change(function() {

		var area = "area"+$("option",$(this)).index($("option:selected",$(this))); // 선택지역의 구군 Array

		var $gugun = $(this).next(); // 선택영역 군구 객체

		$("option",$gugun).remove(); // 구군 초기화



		if(area == "area0")

			$gugun.append("<option value=''>구/군 선택</option>");

		else {

			$.each(eval(area), function() {

				$gugun.append("<option value='"+this+"'>"+this+"</option>");

			});

		}

	});

});
